text/21-self-compiling-compilers.org
#+title: Chapter x : Self-compiling compilers
* <<intro>>

In previous chapters several compilers for very small languages
have been designed,
but none of these languages were suitable for writing their own compilers.
In this chapter several self-compiling compilers are described.
The later ones were /bootstrapped/ from the earlier ones.

* Introduction

This section describes some of the general notions
of self-compilations,
and some language specific background.

** General

Compilers for large languages can be formidable,
especially if they are to generate efficient code for
a language that is conceptually very different from
the machine for which instructions are to be generated.
On the other hand, compilers for small languages
can be very small indeed,
especially if they are to produce code for a machine that has
precisely the sort of operations which the language requires.
This occurs for example when compiling code for a virtual machine,
where this virtual code is either interpreted by a software interpreter,
or further compiled into some actual machine code.

Almost any large universal language is suitable for
reading strings of input characters,
manipulating various tables,
and writing either strings of output characters
or sequences of instructions for some target machine.
Hence almost any such language will be suitable for writing compilers.
The ease with which this can be done depends
on how well the complexities of the two languages are matched:
the simpler the language that is to be compiled,
the easier it is to write a compiler for it in a given language;
the simpler the language in which the compiler is to be written,
the harder it is to write a compiler in it for a given language.

If a language is suitable for writing compilers,
then it becomes possible to write a compiler for
the language in the language itself.
In that case the compiler will be as large as the language it compiles.
None of the languages that we compiled in earlier chapters were suitable
for writing their own compilers.
Even the largest compiler mentioned in the reading of Chapter~14,
Wirth's Pascal-S, cannot compile itself.
The smallest self-compiling Pascal compiler is the P-code compiler
that has been used to bootstrap most of the early Pascal compilers.
But because Pascal is fairly large,
any Pascal compiler will be quite large.

But a self-compiling compiler need not be large at all.
If the language that it compiles is minimally adequate
to describe its own syntax and semantics,
then the compiler itself can be very small indeed.
This chapter describes a sequence of self-compiling
compilers taking character string inputs and
producing character string outputs.
As presented here, the compilers produce code for the DEC editor TECO;
but it would be easy to change the target language.
Both the source and the target forms of the compilers
are included in the text.

The remainder of this chapter contains a description
of a family of quite simple string languages,
HITECO~1, HITECO~2, HITECO~3 and HITECO~4
and their self-compiling compilers.
They are /not/ compatible, but they are evolutionary steps.
The four files containing both the source and their target
forms of the compilers are respectively
7, 12, 17 and 26 blocks (of 512 bytes) long.

