21-self-compiling-compilers.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Chapter x : Self-compiling compilers</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Chapter x : Self-compiling compilers"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-01-11 07:34:47 CST"/>
<meta name="author" content="michal"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Chapter x : Self-compiling compilers</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 intro</a></li>
<li><a href="#sec-2">2 Introduction</a>
<ul>
<li><a href="#sec-2-1">2.1 General</a></li>
<li><a href="#sec-2-2">2.2 The source language and the target language</a></li>
</ul>
</li>
<li><a href="#sec-3">3 A small self-compiling compiler</a>
<ul>
<li><a href="#sec-3-1">3.1 Rationale for HITECO 1</a></li>
<li><a href="#sec-3-2">3.2 The HITECO source code</a></li>
<li><a href="#sec-3-3">3.3 The TECO target code</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Bootstrapping</a>
<ul>
<li><a href="#sec-4-1">4.1 The bootstrapping process in general</a></li>
<li><a href="#sec-4-2">4.2 Bootstrap to HITECO 2</a></li>
<li><a href="#sec-4-3">4.3 Bootstrap to HITECO 3</a></li>
</ul>
</li>
<li><a href="#sec-5">5 A useable self-compiling compiler</a>
<ul>
<li><a href="#sec-5-1">5.1 A description of HITECO 4</a></li>
<li><a href="#sec-5-2">5.2 The HITECO 4 source</a></li>
<li><a href="#sec-5-3">5.3 The TECO target code</a></li>
<li><a href="#sec-5-4">5.4 In conclusion</a></li>
</ul>
</li>
<li><a href="#sec-6">6 Exercises and reading</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <span class="target">intro</span></h2>
<div class="outline-text-2" id="text-1">


<p>
In previous chapters several compilers for very small languages
have been designed,
but none of these languages were suitable for writing their own compilers.
In this chapter several self-compiling compilers are described.
The later ones were <i>bootstrapped</i> from the earlier ones.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Introduction</h2>
<div class="outline-text-2" id="text-2">


<p>
This section describes some of the general notions
of self-compilations,
and some language specific background.
</p>

</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> General</h3>
<div class="outline-text-3" id="text-2-1">


<p>
Compilers for large languages can be formidable,
especially if they are to generate efficient code for
a language that is conceptually very different from
the machine for which instructions are to be generated.
On the other hand, compilers for small languages
can be very small indeed,
especially if they are to produce code for a machine that has
precisely the sort of operations which the language requires.
This occurs for example when compiling code for a virtual machine,
where this virtual code is either interpreted by a software interpreter,
or further compiled into some actual machine code.
</p>
<p>
Almost any large universal language is suitable for
reading strings of input characters,
manipulating various tables,
and writing either strings of output characters
or sequences of instructions for some target machine.
Hence almost any such language will be suitable for writing compilers.
The ease with which this can be done depends
on how well the complexities of the two languages are matched:
the simpler the language that is to be compiled,
the easier it is to write a compiler for it in a given language;
the simpler the language in which the compiler is to be written,
the harder it is to write a compiler in it for a given language.
</p>
<p>
If a language is suitable for writing compilers,
then it becomes possible to write a compiler for
the language in the language itself.
In that case the compiler will be as large as the language it compiles.
None of the languages that we compiled in earlier chapters were suitable
for writing their own compilers.
Even the largest compiler mentioned in the reading of Chapter~14,
Wirth's Pascal-S, cannot compile itself.
The smallest self-compiling Pascal compiler is the P-code compiler
that has been used to bootstrap most of the early Pascal compilers.
But because Pascal is fairly large,
any Pascal compiler will be quite large.
</p>
<p>
But a self-compiling compiler need not be large at all.
If the language that it compiles is minimally adequate
to describe its own syntax and semantics,
then the compiler itself can be very small indeed.
This chapter describes a sequence of self-compiling
compilers taking character string inputs and
producing character string outputs.
As presented here, the compilers produce code for the DEC editor TECO;
but it would be easy to change the target language.
Both the source and the target forms of the compilers
are included in the text.
</p>
<p>
The remainder of this chapter contains a description
of a family of quite simple string languages,
HITECO~1, HITECO~2, HITECO~3 and HITECO~4
and their self-compiling compilers.
They are <i>not</i> compatible, but they are evolutionary steps.
The four files containing both the source and their target
forms of the compilers are respectively
7, 12, 17 and 26 blocks (of 512 bytes) long.
</p>
</div>

</div>
