21-self-compiling-compilers.html

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> The source language and the target language</h3>
<div class="outline-text-3" id="text-2-2">


<p>
This section describes some common features of
all the HITECO source languages
and some general features of the TECO target language.
</p>
<p>
The first source language HITECO 1 was chosen so as to be as small
as possible,
to the extent that this was compatible with self-compilation.
Obviously a fast parsing algorithm was wanted,
so a deterministic parser was required.
In turn, this implied the LL1 condition:
that all alternatives begin with distinct keywords.
</p>
<p>
The later languages evolved in a natural way:
First new features were seen to be desirable,
so the features were added to the existing compiler.
At this point the compiler could compile a somewhat larger language,
but it did not itself use the new features.
Second the new compiler was rewritten so that it now used the new features
and could still compile itself.
Sometimes, in a third step, earlier features were removed
because they were no longer needed,
or because they had been replaced by better ones.
This bootstrapping process is described in
more general terms in a later section.
</p>
<p>
The source languages were to a large extent influenced by the initial
target language TECO,
a utility supplied by Digital Equipment Corporation.
TECO began its life a mere interactive editor,
but it has evolved into a powerful string processing language.
Interactive usage requires brief commands,
so, because of its origins, TECO programs are very compact.
As a result, longer programs tend to be difficult to decipher
a week after they have been written.
All this means that TECO can be seen as a barely legible machine language
for a powerful string processing machine;
it needs a high level version which would be easier to read.
</p>
<p>
The remainder of this section should be skipped by readers who
are only interested in HITECO as a source language.
</p>
<p>
TECO supports the types integer, character and strings of characters.
There is a distinguished string, the editing buffer,
and most operations apply to it,
including input and output to files.
In addition, there are a number of registers
containing single integers or single characters,
or strings of characters.
</p>
<p>
Among the operations applicable to the editing buffer are
anchored searches.
These are a special kind of search which requires the search string
to be matched beginning at the current pointer position.
If there is a successful match,
then the pointer moves and the search returns success
which can be used in a conditional.
If there is no immediate match,
then the pointer is not moved.
Anchored searches are an ideal mechanism for LL1 parsing;
and for that reason all versions of HITECO
require the source language program to reside in the editing buffer.
Strings can be inserted anywhere in the editing buffer,
and they can be appended to registers.
But compilation requires an alternation of
inspecting source language program and
generating target language program.
If the editing buffer were used to hold the code
that is generated,
then the editing pointer would have to alternate between
pointing to a position in the source and
pointing to a position in the target.
So it is simpler to generate code by appending it to registers.
</p>
<p>
When a compiler is compiling itself it is
executing procedures which are located somewhere,
and it generates code for its own procedures.
If it were placing its generated code directly
into the positions in memory that are executing,
then it would be adding code to the registers that are
supposed to be executing at the time.
So any code that is generated has to be placed elsewhere
(and TECO's register 9 was chosen arbitrarily for this purpose).
It is not strictly true that executable code
is generated by HITECO,
instead it is a program which, when executed,
will distribute real code to where it is needed.
So the compiler really generates code for a crude absolute loader
(the code is compiled into TECO's register 9;
the loading is then done by TECO itself,
by the command <code>M9</code>).
</p>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> A small self-compiling compiler</h2>
<div class="outline-text-2" id="text-3">


<p>
The first generation in the HITECO family
consists of very small string to string translator written
in itself and producing TECO code.
Some of the design decisions are discussed,
and both the HITECO and the TECO versions of the translator are given.
HITECO 1 is adequate for expressing simple grammmatical
constructions for a language in which the terminals are
symbols.
It does not have conventional flow of control,
nor does it have data structures,
and it cannot manipulate characters
except by treating them as short symbols.
</p>

</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Rationale for HITECO 1</h3>
<div class="outline-text-3" id="text-3-1">


<p>
This first version of HITECO
was designed in such a way that the parser does not even know
whether it is reading a stream of characters or a stream of symbols.
The initial version of HITECO was designed with
the target machine in mind.
Even extended BNF is not ideally suited for
simple deterministic parsing
which does not know about single characters.
HITECO contains the same kinds of constructions as BNF,
except that a sequence of alternatives is signalled by <code>CHOICE</code>,
each alternative is preceded by <code>WHEN</code>
and has to be followed by a quoted terminal and then a statement,
the sequence is terminated by <code>OTHERWISE</code> and an error message,
inside a concatenation a compulsory quoted terminal
is flanked by <code>CHECK</code> and an error message,
the indefinite repetition is signalled by <code>REP</code>
which has to be followed by a quoted terminal and then a statement,
and there is an explicit concatenation operator <code>;</code>,
and round parentheses may be used for grouping.
</p>
<p>
The grammar uses only one non-terminal <code>STATEMENT</code>.
In the extended BNF which is used below,
quotations denote their content,
juxtaposition denotes concatenation,
the vertical bar denotes alternation,
and the square brackets denote indefinite repetition of what they enclose.
</p>



<pre class="example">STATEMENT ::=
        "STATEMENT" |
        "VARIABLE" |
        "QUOTE" |
        "CODE" |
        "MESSAGE" |
        "PUT"
            CODE |
        "CHECK"
            QUOTE
            MESSAGE |
        "REP"
            QUOTE
            STATEMENT |
        "("
            STATEMENT
            [";"
                STATEMENT]
            ")" |
        "LET"
            VARIABLE
            "="
            STATEMENT |
        "CHOICE"
            ["WHEN"
                QUOTE
                STATEMENT]
            "OTHERWISE"
            MESSAGE
</pre>


<p>
As may be seen from the above,
a statement is either one of the five single terminals
<code>STATEMENT</code>, <code>VARIABLE</code>, <code>QUOTE</code>,
<code>CODE</code>, <code>CODE</code>  or <code>MESSAGE</code>,
or is the terminal <code>PUT</code> followed by code,
or it is the terminal <code>CHECK</code> followed by a quote and a message,
or it is the terminal <code>REP</code> followed by a quote and then a statement,
or it is the terminal <code>LET</code> followed by a variable,
then the terminal === and then a statement,
or it is the terminal <code>(</code> followed by one or more statements
separated by the terminal <code>;</code> and terminated by the terminal <code>)</code>,
or it is the terminal <code>CHOICE</code>
followed by zero or more sequences consisting of the
terminal <code>WHEN</code>, then a quote and then a statement,
followed by the terminal <code>OTHERWISE</code> and a message.
(Note that <code>STATEMENT</code> is a non-terminal,
whereas <code>STATEMENT</code> is a terminal.)
</p>
</div>

</div>
