21-self-compiling-compilers.html

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> The HITECO source code</h3>
<div class="outline-text-3" id="text-3-2">


<p>
The HITECO 1 source code consists of one page of text.
It is a single <code>LET</code> statement which places a single
<code>CHOICE</code> statement into register A.
There are 11 <code>WHEN</code> clauses corresponding to the 11
alternatives in the grammar.
Each WHEN clause consists of a head and a body.
The head consists of a source quote: <code>PUT</code>, <code>(</code>,
<code>CHECK</code>, <code>REP</code> etc., and the bodies consist of simple
statements or of compound statements enclosed
in parentheses.
Simple statements occur for <code>PUT</code>, <code>STATEMENT</code>,
<code>VARIABLE</code>,
compound statements occur for <code>(</code>, <code>CHECK</code>,
<code>REP</code>, <code>LET</code> etc.
Most of the statements are simple <code>PUT</code> statements
which generate code.
Of the remainder,
the simple ones are either recursive calls to <code>STATEMENT</code>,
or calls to procedures in the run time support:
<code>QUOTE</code>, <code>CODE</code>, <code>MESSAGE</code> and <code>VARIABLE</code>.
The composite statements are <code>REP</code> or <code>CHECK</code> constructions,
or they are compound statements enclosed in parentheses.
The <code>CHOICE</code> statement and the <code>LET</code> statement are composite too.
To enhance readability,
all <code>PUT</code> statements have been placed towards the right,
by ignoring them and only reading what is on the left
one gets the syntax of HITECO without the messy code
that has to be generated.
</p>



<pre class="example">LET A =
  CHOICE
    WHEN "STATEMENT"     PUT "@:^U9'MA'"
    WHEN "VARIABLE"      PUT "@:^U9'M3'"
    WHEN "QUOTE"         PUT "@:^U9'1M7'"
    WHEN "CODE"          PUT "@:^U9'0M7'"
    WHEN "MESSAGE"       PUT "@:^U9'0M7'"
    WHEN "PUT"
      CODE
    WHEN "CHECK"        (PUT "@:^U9'@::S'";
      QUOTE;             PUT '@:^U9%"SM6% @:^U9%~      |M5% 1@:^U9%%';
      MESSAGE;           PUT "1@:^U9%%@:^U9%'%" )
    WHEN "REP"          (PUT "@:^U9'&lt;@::S'";
      QUOTE;             PUT "@:^U9';M6'";
      STATEMENT;         PUT "@:^U9'&gt;'" )
    WHEN "("
      (STATEMENT;
      REP ";"
        STATEMENT;       PUT "~      ";
      CHECK ")"
        "')' expected in compound statement" )
    WHEN "LET"          (PUT "@:^U9'@^U'";
      VARIABLE;          PUT "47@:^U9%% M4 @:^U9%  %~      ";
      CHECK "="
        "'=' expected in let statement ";
                         PUT "~      ";
      STATEMENT;         PUT "47@:^U9%% M4" )
    WHEN "CHOICE"       (PUT "@:^U9'&lt;'";
      REP "WHEN"         (PUT "M4@:^U9'    @::S'";
        QUOTE;            PUT '@:^U9%"SM6% M4~      @:^U9%      %';
        STATEMENT;        PUT "@:^U9%0;'%" );
                         PUT "~      M4";
      CHECK "OTHERWISE"
        "'OTHERWISE' expected in choice statement";
                         PUT '~      @:^U9%    M5% 1@:^U9%%';
      MESSAGE;           PUT "1@:^U9%%@:^U9'0;&gt;'")
    OTHERWISE
      "illegal in statement"
</pre>


<p>
TECO is just about an ideal processor for HITECO;
this is not surprising
since HITECO was designed for that purpose.
Nevertheless it was found convenient to augment TECO
with five small procedures which act as run-time support:
</p>
<p>
The first one handles quotes, codes and messages:
essentially it remembers the first printing character which initiates the item
and served as a quote,
and then steps through the content of the item
copying characters to the code until it sees the matching character
which terminates the item.
The next one is a simple scanner which skips blanks,
tabs and newlines.
The next one handles errors: it writes the current line
up to the current parsing position,
then it writes ===HERE=&gt;=, then it writes the rest of the line.
The next procedure is used solely for formatting the target code
by writing a newline without the need for the newline character
in the source (which would spoil its appearance).
The last procedure checks that the character at the current
parsing position is a letter,
otherwise it calls the error procedure and writes a message.
</p>



<pre class="example">PUT %

!    R U N   T I M E   S U P P O R T   !

! QUOTE = 7 !
@^U7/ U7 ! save parameter !
0AU8 C Q7"NQ8@:^U9\\'
&lt;0A-Q8"E0;
 |  0A-126"EM4|0A@:^U9\\'  C'&gt;
C Q7"NQ8@:^U9\\' M6
/
! scanner = 6 !
@^U6/&lt; 0A-32"=CF&lt;' 0A-9"=CF&lt;' 0A-13"=CCF&lt;' 0; &gt;
/
! error reporter = 5 !
@^U5/^A
^A0T^A===HERE==&gt;^A1T
/
! putln = 4 !
@^U4/13@:^U9\\10@:^U9\\
/
! VARIABLE = 3 !
@^U3/0A"A 0A@:^U9\\ CM6 |M5^A VARIABLE EXPECTED ^A'
/
%
 .
</pre>


<p>
Since the runtime support does not involve any recursive calls,
it would have been possible to unfold such calls
in the <code>PUT</code> statements inside the principal procedure <code>A</code>
which compiles statements.
This was not done because unfolding the many calls
to these procedures would have made the compiler so much longer.
However, since such a "pure" compiler would be of some
interest, it is worth contemplating.
</p>
</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> The TECO target code</h3>
<div class="outline-text-3" id="text-3-3">


<p>
This section is specific to the TECO implementation
of HITECO.
Readers who are not familiar with TECO may well wish to
skip this section.
The TECO object code constitutes the first half
of the file which is presented in the next section.
It is assumed that the entire code will be executed;
one way to do it is to put it into any arbitrary Q-register
(say Q-register 9), and then call it (by <code>M9</code>).
The effect will be to load portions of it into other
Q-registers, as follows:
The bulk of the code, for <code>STATEMENT</code> will be loaded
into Q-register A.
The remaining short portions constitute the run-time
environment, they are loaded into the Q-registers
as indicated.
</p>
<p>
The file contains several control-A characters
which are not printed by the line printer.
For that reason the file is reproduced here in the form
TECO would type it out.
Any control-A characters are reproduced as two characters: <code>^A</code>,
up-arrow and A.
In all other respects the file is exactly as shown here.
</p>



<pre class="example">@^UA/
  &lt;
    @::S"STATEMENT""SM6
      @:^U9'MA'0;'
    @::S"VARIABLE""SM6
      @:^U9'M3'0;'
    @::S"QUOTE""SM6
      @:^U9'1M7'0;'
    @::S"CODE""SM6
      @:^U9'0M7'0;'
    @::S"MESSAGE""SM6
      @:^U9'0M7'0;'
    @::S"PUT""SM6
      0M70;'
    @::S"CHECK""SM6
      @:^U9'@::S'1M7@:^U9%"SM6% @:^U9%
      |M5% 1@:^U9%%0M71@:^U9%%@:^U9%'%0;'
    @::S"REP""SM6
      @:^U9'&lt;@::S'1M7@:^U9';M6'MA@:^U9'&gt;'0;'
    @::S"(""SM6
      MA&lt;@::S";";M6MA&gt;
      @::S")""SM6
      |M5^A')' expected in compound statement^A'0;'
    @::S"LET""SM6
      @:^U9'@^U'M347@:^U9%% M4 @:^U9%  %
      @::S"=""SM6
      |M5^A'=' expected in let statement ^A'
      MA47@:^U9%% M40;'
    @::S"CHOICE""SM6
      @:^U9'&lt;'&lt;@::S"WHEN";M6M4@:^U9'    @::S'1M7@:^U9%"SM6% M4
      @:^U9%      %MA@:^U9%0;'%&gt;
      M4@::S"OTHERWISE""SM6
      |M5^A'OTHERWISE' expected in choice statement^A'
      @:^U9%    M5% 1@:^U9%%0M71@:^U9%%@:^U9'0;&gt;'0;'
    M5^Aillegal in statement^A0;&gt;/

!    R U N   T I M E   S U P P O R T   !

! QUOTE = 7 !
@^U7/ U7 ! save parameter !
0AU8 C Q7"NQ8@:^U9\\'
&lt;0A-Q8"E0;
 |  0A-126"EM4|0A@:^U9\\'  C'&gt;
C Q7"NQ8@:^U9\\' M6
/
! scanner = 6 !
@^U6/&lt; 0A-32"=CF&lt;' 0A-9"=CF&lt;' 0A-13"=CCF&lt;' 0; &gt;
/
! error reporter = 5 !
@^U5/^A
^A0T^A===HERE==&gt;^A1T
/
! putln = 4 !
@^U4/13@:^U9\\10@:^U9\\
/
! VARIABLE = 3 !
@^U3/0A"A 0A@:^U9\\ CM6 |M5^A VARIABLE EXPECTED ^A'
/
</pre>


</div>
</div>

</div>
