text/21-self-compiling-compilers.org
* Bootstrapping

For all self-compiling compilers,
the first compilation has to be done by hand,
so that the compiler writer has to write
both the source version and the target version.
Then the target version can be used to machine compile the source version,
to produce a second copy of the target version.
If all went well,
the two target versions should be identical.
>From then on everything is done by bootstrapping.
This section gives a general description of the process of bootstrapping
compilers --- using an early form of a compiler to help produce
a better form, and a specific description of bootstrapping
HITECO.

** The bootstrapping process in general

A compiler which compiles itself can be used to compile any programs
in the language it compiles,
and these programs need not have anything to do with compilation.
But if the language is small, designed for self-compilation and little else,
then one would be hard pressed to write anything but compilers in it.
One major use of a self-compiling compiler is as a so-called
bootstrapping device for writing a better compiler.
Here /better/ can mean several things.
In the first place, if the language it compiles is the same as the original,
then it can mean any one of:
1) prettier formatting of the target code, making it easier to read, or
2) greater efficiency during the compilation process, or
3) greater efficiency of the code that is produced.
Note that for a compiler that is not written in itself,
2) and 3) are quite distinct aspects of efficiency,
and that for a self-compiling compiler
the way to achieve 2) is to achieve 3).
On the other hand, /better/ can also mean a different source language
which is
4) easier to read, or
5) makes the writing of the compiler easier, or
6) has more useable features.
The way to achieve 4) and 5) is to achieve 6).

The bootstrapping process consists of repeatedly applying the following steps.
Assume that version(i) of the compiler exists in two forms,
the source form source(i), and
the target form target(i).
First the current source form of the compiler is edited
to become source(i+1).
This new source still has to be written in the language which
target(i) can compile,
but it can differ either in the code generation
or in the language which it can compile.
The new source is compiled by target(i) to produce
a new compiler, target(i+1).
This can now be used in the next repetition.
If the editing changes merely concerned improved compilation,
then target(i+1) will produce better code,
but it will not be faster at compiling because its
code was generated by target(i).
To obtain a better compiler,
the bootstrap loop has to be repeated again,
using source(i+1) as the input to target(i+1)
to produce target(i+2) which will now be the improved version.
If the code concerned modifications to the code that will be generated
during compilation,
then the process has to be repeated a further time
so that the improvements eventually reach target(i+3).
On the other hand,
if the editing changes concern the source language,
then the new compiler will be able to compile a new language.
But so far nothing has been written in this new language,
and one way to do so is to edit source(i+1) so that it is now
written in the new language.
At this point we have a new compiler source(i+2) for a new language,
written in itself,
and we have an executable form target(i+1) whose source was still written
in the previous language.
Another compilation produces target(i+2),
and the bootstrap is complete.

A very useful check to make is the seemingly pointless self-compilation:
use target(i) to compile source(i) producing target(i+1).
If the compiler is stable now,
then target(i+1) will be identical to target(i).
If the compilation is not stable yet,
then it may take another self-compilation to reach this point.
But it can also happen that after one or two self-compilations
the resultant target(i+1) or target(i+2) does not work at all;
in that case an error has occurred earlier.
In this way self-compilation is an important internal check.

