text/21-self-compiling-compilers.org
** Bootstrap to HITECO 2

The first generation in the HITECO family
consists of a very small string to string translator written
in itself and producing TECO code.
The second generation has its run-time support written in itself.
Some of the design decisions are discussed,
and both the HITECO and the TECO versions of the translator are given.
The run time support for HITECO 1 required features
which could not be written in HITECO 1 itself.
The principal objective of HITECO 2 was to make it possible
to write this runtime support in HITECO 2 itself.

HITECO is adequate for expressing grammmatical constructions
for a language in which the terminals are symbols.
It does not have conventional flow of control,
and it cannot manipulate characters.
But both of these are required in the run time support.
So, these features were added to HITECO2.

HITECO2 can be described by a grammar with three nonterminals:
=STATEMENT=, =CONDITION= and =EXPRESSION=.
The compiler for HITECO1 consists of just one procedure,
and a single =PUT= statement for generating the runtime support.
For HITECO2 the source code consists of a total of eight
procedures written entirely in HITECO2.
Each procedure is defined by a =LET= statement.
The procedures for parsing the three non-terminals
=STATEMENT=, =CONDITION=  and =EXPRESSION=
are located in the alphabetic registers =A=, =B= and =C=,
respectively.
A grammar for HITECO2 is easily reconstructed from the source
by reading =LET A = ..= as =STATEMENT ::= ..=,
=LET B = ..= as =CONDITION ::= ..=, and
=LET C = ..= as =EXPRESSION ::= ..=.
The bodies of the three rules should be easy enough to
reconstruct by ignoring the right half of the page with
the code generation.

The run-time support for HITECO2 is almost identical
to that of HITECO1, except that it is now written in HITECO2 itself.
There are five procedures in the run-time support,
and their code is located in registers 3, 4, 5, 6 and 7.

The largest and most important compiling procedure is for =STATEMENT=,
and it is essentially an enriched version of the single
compiling procedure for HITECO1.
Some of the inbuilt atomic statements correspond to non-terminals,
including =STATEMENT= itself.
The execution of such atoms generates code.
An entirely new atomic statement is the assignment statement,
which had to be made of the form =MOVE e TO v=,
where =e= is an expression and =v= is a variable name consisting
of a single letter or digit.
The new flow of control statements include a conventional =IF_THEN=
statement with an optional =ELSE= part,
and a new =LOOP= statement with =EXIT=s.

The condition of the =IF= part of a conditional is handled by a separate
compiling procedure;
conditions consist of a numeric expression followed either by one of
three comparison operators and then another expression,
or by one of three postfix predicates which are true
if the value of the expression is an ASCII code for a letter,
a digit, or either of the two.
The last is needed because the compiler cannot handle more general
disjunctions.

An expression is either a number, recognised by its initial leading digit,
or the value of the inbuilt special variable =CH=
representing the numeric =ASCII= value of the currently visible character
as seen by the scanner,
or a variable whose value is in a =REGISTER=,
or a parameter of a procedure.

The procedure which the =LET= statement
puts into register 7 is invoked in =STATEMENT=
by =QUOTE=, =CODE= and =MESSAGE=.
It takes a parameter which is either 0 or 1 or 2,
and the value of that parameter determines whether
the quotation symbol of the source
is used for the code or not:
As may be seen in =STATEMENT=,
=CODE= uses parameter 0,
and in this case the quotation symbols are stripped off,
=QUOTE= uses parameter 1,
and in this case the quotation symbols are retained,
and =MESSAGE= uses parameter 2,
and in this case =^A= (control-A) is used as the quotation symbol.

The procedure which the =LET= statement
puts into register 6 is the scanner which
uses the inbuilt procedure =GETCH= to skip
one character for spaces and tabs, and two characters
for carriage returns --- the other character skipped
is the line feed.
The conditional is in a loop,
the inbuilt procedure =RESTART= sends control back
to the beginning of the loop,
and the inbuilt procedure =EXIT= sends control
beyond the end of the loop.

The procedure which the =LET= statement
puts into register 5 is the error
reporter; it writes a new line to the terminal,
the beginning of the current line being parsed,
an arrow to the current parsing position,
and the remainder of the current line.
The procedure which the =LET= statement
puts into register 4 merely writes
a new line to the object code.
The procedure which the =LET= statement
puts into register 3 checks that the
current character being scanned is
a symbol constituent --- essentially a letter or a digit.

The following is the HITECO2 compiler written in HITECO2 itself.
The target form of HITECO2 written in TECO is not given here
because it is just an enriched form of the target form of HITECO1
written in TECO.

#+begin_example
LET A =
  CHOICE
    WHEN "GEN"                  (PUT "@:^U9\@:^U9&\";
      CODE;                      PUT "@:^U9\&\")
    WHEN "STATEMENT"            GEN "MA"
    WHEN "CONDITION"            GEN "MB"
    WHEN "EXPRESSION"           GEN "MC"
    WHEN "VARIABLE"             GEN "M3"
    WHEN "CODE"                 GEN "0M7"
    WHEN "QUOTE"                GEN "1M7"
    WHEN "MESSAGE"              GEN "2M7"
    WHEN "NUMBER"               GEN %<0A"D0A@:^U9\\C | 0;'>M6%
    WHEN "REP"                  (GEN "<@::S";
      QUOTE;                     GEN ";M6";
      STATEMENT;                 GEN ">")
    WHEN "CHECK"                (GEN "@::S";
      QUOTE;                     GEN '"SM6~      |M5';
      MESSAGE;                   GEN "'")
    WHEN "OPT"                  (GEN "@::S";
      QUOTE;                     GEN '"SM6';
      STATEMENT;                 GEN "'" )
    WHEN "CHOICE"               (GEN "<";
      REP "WHEN"                 (PUT "~      M4";  GEN "    @::S";
        QUOTE;                    GEN '"SM6';
                                  PUT "~      M4"; GEN "      ";
        STATEMENT;                GEN "0;'" );
                                 PUT "~      ";
      CHECK "OTHERWISE" "'OTHERWISE' expected in CHOICE statement";
                                 PUT "~      M4"; GEN "    M5";
      MESSAGE;                   GEN "0;>")
    WHEN "ERROR"                GEN "M5"
    WHEN "SCAN"                 GEN "M6"
    WHEN "GETCH"                GEN "C"
    WHEN "RESTART"              GEN "F<"
    WHEN "EXIT"                 GEN "0;"
    WHEN "PUT"
      CODE
    WHEN "APPEND"
      (EXPRESSION;              GEN "@:^U9\\")
    WHEN "TYPE"
      (EXPRESSION;              GEN "T")
    WHEN "WRITE"
      MESSAGE
    WHEN "("
      (STATEMENT;
        REP ";"
          STATEMENT;
        CHECK ")" "')' expected in compound statement" )
    WHEN "IF"                   (PUT "M4";
      CONDITION;
      CHECK "THEN" "'THEN' expected in conditional";
      STATEMENT;                 PUT "~      ";
      OPT "ELSE"                 (GEN "|";
        STATEMENT);             GEN "'")
    WHEN "LOOP"                 (GEN "<";
      STATEMENT;                 GEN ">")
    WHEN "LET"                  (GEN '@^U';
      VARIABLE;                  APPEND 47; PUT "~      ";
      CHECK "="  "'=' expected in let statement ";
                                 PUT "~      M4";
      STATEMENT;                 APPEND 47; PUT "M4M4")
    WHEN "MOVE"
      (EXPRESSION;
      CHECK "TO" "'TO' expected in move statement";
                                 GEN "U";
      VARIABLE)
    OTHERWISE
      "illegal in statement"

(LET B =
  (EXPRESSION;
  CHOICE
    WHEN "="                    (GEN "-";
      EXPRESSION;                GEN '"=')
    WHEN "<"                    (GEN "-";
      EXPRESSION;                GEN '"<')
    WHEN ">"                    (GEN "-";
      EXPRESSION;                GEN '">')
    WHEN "ALPHABETIC"           GEN '"A'
    WHEN "DIGIT"                GEN '"D'
    WHEN "CONSTITUENT"          GEN '"C'
    OTHERWISE "illegal predicate in condition");

LET C =
  IF CH DIGIT THEN NUMBER ELSE
    CHOICE
      WHEN "CH"                 GEN "0A"
      WHEN "REGISTER"           (GEN "Q";
        VARIABLE)
      WHEN "PARAMETER"          PUT "  "
      OTHERWISE "illegal in expression";

LET 3 =
  IF CH CONSTITUENT THEN
    (APPEND CH;
    GETCH;
    SCAN)
  ELSE
    (ERROR;
    WRITE "variable expected~");

LET 4 =
  (APPEND 13;
  APPEND 10);

LET 5 =
  (WRITE "~";
  TYPE 0;
  WRITE "===HERE==>";
  TYPE 1);

LET 6 =
  LOOP
    (IF CH = 32 THEN (GETCH; RESTART);
    IF CH = 9 THEN (GETCH; RESTART);
    IF CH = 13 THEN (GETCH; GETCH; RESTART);
    EXIT)
)

LET 7 =
  (MOVE PARAMETER TO 7;
  MOVE CH TO 8;
  GETCH;
  IF REGISTER 7 = 1 THEN APPEND REGISTER 8
  ELSE IF REGISTER 7 = 2 THEN APPEND 1;

  LOOP
    IF CH = REGISTER 8 THEN EXIT ELSE
      (IF CH = 126
         THEN PUT "M4"
         ELSE APPEND CH;
      GETCH);
  GETCH;
  IF REGISTER 7 = 1 THEN APPEND REGISTER 8
  ELSE IF REGISTER 7 = 2 THEN APPEND 1;
  SCAN)
 .
#+end_example

