21-self-compiling-compilers.html

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Bootstrap to HITECO 3</h3>
<div class="outline-text-3" id="text-4-3">


<p>
One of the principal shortcomings of HITECO2
was the fact that procedures only had single character names.
Hence the compiling procedures for <code>STATEMENT</code>, <code>CONDITION</code>
and <code>EXPRESSION</code> were actually called <code>A</code>, <code>B</code> and <code>C</code>.
Inside <code>STATEMENT</code>, there were three special purpose statements
namely <code>STATEMENT</code>, <code>CONDITION</code> and <code>EXPRESSION</code>,
which generated code to generate code to call <code>A</code>, <code>B</code> and <code>C</code>,
but they did not actually call <code>A</code>, <code>B</code> and <code>C</code> themselves.
So, HITECO2 looked deceptively like a recursive descent compiler,
but it was really something else.
To obtain a normal recursive descent compiler,
the nonterminals of the grammar should correspond to
compiling procedures.
</p>
<p>
Except for very simple grammars,
recursive descent parsers have to satisfy quite
strict visibility requirements.
One way of satisfying such requirements is the use of block structure,
as we have done in several earlier parsers and translators.
Another way is to give forward declarations
(as we did for ver and fal in the model generator of Chapter~14).
This is a generally useful method,
and HITECO3 uses it.
A program has to begin with forward declarations
for all procedures.
The purpose of the forward declarations
is to put the names of the declarations
into a symbol table,
and, depending on the target language,
associate code information with the names.
In the case of TECO target code,
the required code information is the single letter
name of the Q-register which contains the code for the procedure.
After the forward declarations follow the declarations
of the bodies of the procedures.
The translated code for these bodies has to be placed into the Q-registers
which were assigned to the names of the procedures
during the forward declarations.
In detail,
since the translator produces code for a loader,
the translator has to look up the symbol table
in order to tell the loader into which Q-register to place
the code which the translator
is about to produce when it is translating a body.
In the same way,
if the body contains calls to procedures,
the translator has to look up the symbol table
in order to produce code for a call of TECO code in the
right Q-register.
Apart from the change just described,
the language was left fairly unchanged.
</p>
<p>
The same process of bootstrapping was applied to HITECO2 to obtain
a new self-compiling compiler for a language HITECO3.
But this language was still inelegant.
In particular,
the <code>WHEN</code> before the individual choices
and the <code>CHECK</code> before required symbols
did not seem necessary from a logical point of view,
although they had been operationally necessary
for the simple parser that could be written in the language.
To make the input language look more like BNF,
<code>WHEN</code> and <code>CHECK</code> were eliminated
in the next version, as described in detail in the next section.
</p>
</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> A useable self-compiling compiler</h2>
<div class="outline-text-2" id="text-5">


<p>
The fourth generation of HITECO adds several new features.
Some of the design decisions are discussed,
and both the HITECO and the TECO versions of the translator are given.
</p>

</div>
