21-self-compiling-compilers.html

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> A description of HITECO 4</h3>
<div class="outline-text-3" id="text-5-1">


<p>
A program begins with forward declarations of all procedures,
this is necessary because nesting of procedures is not possible
and there is mutual recursion for which the calling procedure
has to know where the code for the called procedure is located.
The HITECO4 compiler begins with forward declarations of 18 procedures.
</p>
<p>
The first compiling procedure is for the non-terminal <code>program</code>.
Its body consists of a statement sequence,
essentially for compiling the forward declarations
of the procedure names
and then the bodies of procedure declarations.
Note that in the body of procedure <code>program</code>
everything having to do with code generation has
again been shifted to the
right part of the page.
This leaves the left half containing a relatively pure
description of the input language.
For example, the part for the procedure declarations says that until the
current printing character is a period,
the word <code>PROCEDURE</code> is required,
and if it is not there then an error message is given which is
constructed from the missing word and the string <code>program</code> which follows.
The error message then will be:
='PROCEDURE' expected in program=.
After the word <code>PROCEDURE</code> a procedure name is expected;
this is handled by a separate compiling procedure.
Following that, === is required,
otherwise the error message ='=' expected in program= is given.
As may be seen from these two examples,
required symbols are written in double quotes,
followed by another quotation containing another part of the
error message.
After the === a statement is expected, as described next.
</p>
<p>
The long compiling procedure for the non-terminal <code>statement</code>
has as its body a single <code>CHOICE</code> statement.
Note that the various choices all begin with a quoted string,
which may be the currently visible symbol;
if it is, then the body of the particular choice is entered.
So a <code>CHOICE</code> statement is somewhat similar to a <code>CASE</code> statement.
The first few choices are inbuilt atomic statements,
mostly having to do with code generation.
The next few take parameters, but they are still atomic statements ---
they do not have further statements as parts.
The first non-atomic statement type is the <code>LOOP</code> statement,
consisting of the keyword <code>LOOP</code> followed by another statement.
Typically the other statement will be a compound statement,
consisting of several statement separated by semicolons
and the whole enclosed in parentheses,
typically at least one of these other statements will be
an  <code>EXIT</code> statement or at least contain one.
In the compiling procedure for statement,
following the <code>LOOP</code> statement is the compound statement: <code>(</code>
followed by a <code>SEQ=uence of statements =SEP=arated by =;</code>,
followed by <code>)</code> &mdash; otherwise the error
='=' expected in compound statement= is given.
<code>SEQ</code>-statements are explained a little further down,
as consisting of <code>SEQ</code> followed by a statement followed by <code>SEP</code>
and then a quote &mdash; the separator, such as <code>;</code> above.
The next kind of statement is the <code>CHOICE</code> statement,
consisting of <code>CHOICE</code>, a list of choices that are handled by
a separate compiling procedure,
then a compulsory <code>OTHERWISE</code>
and a final statement.
Note that this particular part of the compiling procedure
for <code>statement</code> describes the structure of the statement
which is the body of the compiling procedure.
The remaining compound statements are mostly self-explanatory,
except perhaps the <code>TO</code> statement, which is like a <code>FOR</code> statement
of Pascal without the <code>FOR</code> part &mdash; the expression is evaluated
and its value is the number of times the <code>DO</code> part will be executed.
</p>
<p>
If a statement does not start with any of the explicit keyword choices,
then the <code>OTHERWISE</code> part of the compiling procedure for statement is
activated.
If the current character is a double quote,
then the characters up to the closing quote are taken
as a required terminal &mdash; such as <code>)</code>, <code>THEN</code>, <code>DO</code> etc.,
and if they are not present,
then the required terminal together with the following
explanatory <code>MESSAGE</code> are combined to report an error.
If the current character is a lower case letter,
then the ensuing characters are read and used to lookup the
table that was produced by the forward declarations.
Following the procedure name,
a (possibly empty) parameter list is parsed next.
If the current character is an uppercase letter,
then it is the name of a variable in an assignment statement,
for which <code>:=</code> and an expression are expected next.
</p>
<p>
The next compiling procedure is for the non-terminal <code>CONDITION</code>.
A condition consists either of the keyword <code>MATCH</code>
followed by a quotation to be matched at the current parsing position,
or of an expression followed by a predicate.
(The first line of the body of this procedure is
typical of the problems with self-compiling compilers:
The first <code>MATCH</code> is already compiled, the quoted ="MATCH"=
is what the next generation will require.)
</p>
<p>
The next compiling procedure is for <code>expression</code>,
not in an ideal syntax but forced by the limited recursion facility
of the target language TECO.
The keyword expressions correspond mainly to
the ASCII codes of special characters,
or parenthesised expressions containing infix operators.
Other expressions can be single upper case letters for variables,
or digit strings which evaluate to numbers.
The procedure <code>infix</code> compiles those parts of expressions
beginning with arithmetic infix operators;
the procedure <code>predicate</code> deals with either
postfix predicates or comparison operators followed by expressions.
</p>
<p>
There are a few more compiling procedures for parameter lists
(which the compiler does not check),
and for three other kinds of lists ---
those in <code>CHOICE</code>, <code>OPCODE</code> and <code>CASE</code> statements.
</p>
<p>
The target code consists of a number of procedure
bodies which are stored in Q-registers:
</p>



<pre class="example">REGISTER        PROCEDURE
                                (compiling procedures)
E               program
F               statement
G               condition
H               expression
M               infix
U               predicate
S               parameterlist
J               listchoices
K               listopcodes
L               listcases
                                (utility procedures)
N               procedurename
O               error
P               scan
Q               string
R               outchar
T               emit
V               glc
I               declaration
</pre>


<p>
    To compile a HITECO 4 program, the TECO command <code>ME</code>
has to be given.
</p>
</div>

</div>
