21-self-compiling-compilers.html

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> The HITECO 4 source</h3>
<div class="outline-text-3" id="text-5-2">


<p>
The following is the source:
</p>



<pre class="example">DECLARE (* forward names of procedures *)
  program
  statement condition expression declaration
  listchoices listopcodes listcases infix
  procedurename error scan string outchar parameterlist
  emit predicate glc .

(* ---   C O M P I L I N G   P R O C E D U R E S   --- *)

PROCEDURE program =
                                        (glc(0);scan;
  OPT "DECLARE" declaration;
  UNTIL CH = PERIOD DO                  (TYPE(1);
    "PROCEDURE" "program";               GEN "@^U";
    procedurename;                       APP PROCEDUREQUOTE;
    "=" "program";
    statement;                           APP PROCEDUREQUOTE;
                                         GEN "~~"))

PROCEDURE statement =
  CHOICE
    "SKIP"                               SKIP
    "GNR"                                emit
    "NUMBER"                             GNR number
    "VALUE"                              glc(3)
    "GETCH"                              GEN "C"
    "RESTART"                            GEN "F&lt;"
    "EXIT"                               GEN "0;"
    "CODE"                               PRD string(0)
    "QUOTE"                              PRD string(1)
    "MESSAGE"                            PRD string(2)
    "PUT"
      CODE
    "GEN"                               (PUT "@:^U9\@:^U9&amp;\";
      CODE;                              PUT "@:^U9\&amp;\")
    "PRD"                               (PUT "@:^U9\@:^U9&amp;\";
      statement;                         PUT "@:^U9\&amp;\")
    "RETURN"
      expression
    "APP"
      (expression;                       GEN "@:^U999")
    "SEARCH"                            (GEN "@S";
      QUOTE)
    "TYPE"
      (parameterlist;                    GEN "T")
    "LINE"
      (parameterlist;                    GEN "L")
    "JUMP"
      (parameterlist;                    GEN "J")
    "WRITE"
      MESSAGE
    "LASTWISH"                          (PRD error;
      MESSAGE;                           GEN "^C")
    "LOOP"                              (GEN "&lt;";
      statement;                         GEN "&gt;")
    "("
      (SEQ statement SEP ";";
      ")" "compound statement")
    "REP"                               (GEN "&lt;@::S";
      QUOTE;                             GNR rep1;
      statement;                         GEN "&gt;")
    "CHECK"                             (GEN "@::S";
      QUOTE;                             GNR check1;
      MESSAGE;                           GEN "'")
    "OPT"                               (GEN "@::S";
      QUOTE;                             GNR opt1;
      statement;                         GEN "'")
    "SEQ"                               (GEN "&lt;";
      statement;
      "SEP" "sequence statement";        GEN "~  @::S";
      QUOTE;                             GNR seq3)
    "CHOICE"                            (GEN "&lt;";
      listchoices;
      "OTHERWISE" "CHOICE statement";
      statement;                         GEN "0;&gt;")
    "OPCODES"                           (GEN "&lt;";
      listopcodes;
      "OTHERWISE" "OPCODES statement";
      statement;                         GEN "0;&gt;")
    "WHILE"                             (GEN "&lt;";
      condition;                         GEN "|0;'";
      "DO" "WHILE statement";
      statement;                         GEN "&gt;")
    "UNTIL"                             (GEN "&lt;";
      condition;                         GEN "0;'";
      "DO" "UNTIL statement";
      statement;                         GEN "&gt;")
    "TO"
      (expression;
      "DO" "TO statement";               GEN "&lt;";
      statement;                         GEN "&gt;")
    "IF"                                (GEN "~";
      condition;
      "THEN" "conditional";
      statement;
      OPT "ELSE"                        (GEN "|";
        statement);                      GEN "'")
    "CASE"
      (expression;                       GNR cas1;
      "OF" "CASE statement";
      listcases;                         GEN "!others!";
      "OTHERWISE" "CASE statement";
      statement;                         GEN "0;&gt;")
    OTHERWISE
      IF CH = DOUBLEQUOTE THEN          (glc(1);
        QUOTE;                           glc(2);
        MESSAGE;                         GEN "^C'")
      ELSE IF CH LOWERCASE THEN         (V := LOOKUP;
        parameterlist;                   GEN "M"; APP V)
      ELSE IF CH UPPERCASE THEN         (V := CH; GETCH;
        scan;
        ":=" "assignment statement";
        expression;                     GEN "U"; APP V)
      ELSE
        LASTWISH "illegal in statement~"

PROCEDURE condition =
  IF MATCH  "MATCH" THEN                (GEN "@::S";
      QUOTE;                             GNR opt1)
    ELSE
      (expression;
       predicate)

PROCEDURE expression =
  CHOICE
    "PARAMETER"                          SKIP
    "CH"                                 GEN "0A"
    "POINTER"                            GEN "."
    "TAB"                                GEN "9"
    "LF"                                 GEN "10"
    "CR"                                 GEN "13"
    "SP"                                 GEN "32"
    "PROCEDUREQUOTE"                     GEN "96"
    "NEWLINEMARKER"                      GEN "126"
    "DOUBLEQUOTE"                        GEN '^^"'
    "PERIOD"                             GEN "^^."
    "LOOKUP"                             GNR look0
    "("                                 (GEN "(";
      expression;
      infix;
      ")"  "expression";                 GEN ")")
    OTHERWISE
      IF CH UPPERCASE
        THEN (GEN "Q"; APP CH; GETCH; scan)
      ELSE IF CH DIGIT
        THEN NUMBER
      ELSE
        LASTWISH "illegal in expression~"

PROCEDURE infix =
  LOOP
    (IF MATCH "+" THEN                  (GEN "+";
        expression;                      RESTART);
     IF MATCH "-" THEN                  (GEN "-";
        expression;                      RESTART);
     IF MATCH "*" THEN                  (GEN "*";
        expression;                      RESTART);
     IF MATCH "/" THEN                  (GEN "/";
        expression;                      RESTART);
     EXIT)

PROCEDURE predicate =
  CHOICE
    "ALPHABETIC"                         GEN '"A'
    "LOWERCASE"                          GEN '"V'
    "UPPERCASE"                          GEN '"W'
    "DIGIT"                              GEN '"D'
    "CONSTITUENT"                        GEN '"C'
    "="                                 (GEN "-";
      expression;                        GEN '"=')
    "&lt;"                                 (GEN "-";
      expression;                        GEN '"&lt;')
    "&gt;"                                 (GEN "-";
      expression;                        GEN '"&gt;')
    OTHERWISE
      LASTWISH "illegal predicate~"

PROCEDURE parameterlist =
OPT "("
  (expression;
  OPT ","                               (GEN ",";
    expression);
  ")" "parameterlist")

PROCEDURE listchoices =
  WHILE CH = DOUBLEQUOTE DO             (GEN "~@::S";
    QUOTE;                               GNR opt1;
    statement;                           GEN "0;'")

PROCEDURE listopcodes =
  WHILE CH = DOUBLEQUOTE DO             (GEN "~@::S";
    QUOTE;                               GNR opt1;
    "-&gt;" "correspondence";               GEN "@:^U9\@:^U9";
    QUOTE;                               GEN "\0;'")

PROCEDURE listcases =
  WHILE CH DIGIT DO                     (GEN "!";
    NUMBER;                              GEN "!";
    ":" "cases";
    statement;                           GEN "0;")

(* ---   U T I L I T Y   P R O C E D U R E S   --- *)

PROCEDURE procedurename =
  (IF CH LOWERCASE THEN
      R := LOOKUP
   ELSE IF CH CONSTITUENT THEN
     (R := CH; GETCH; scan)
   ELSE
     LASTWISH "procedurename expected~";
   APP R)

PROCEDURE error =
  (P := POINTER;
   LINE(0);
   WRITE "*****   ";
   TYPE(1);
   WRITE "        "; (* 8 spaces *)
   TO (P - POINTER) DO
     (IF CH = TAB
        THEN WRITE "    " (* one tab *)
        ELSE WRITE " ";
      GETCH);
   WRITE "^~";
   JUMP(P))

PROCEDURE scan =
  LOOP
    (IF CH = SP THEN
       (GETCH; RESTART);
     IF CH = TAB THEN
       (GETCH; RESTART);
     IF CH = CR THEN
       (GETCH; GETCH; RESTART);
     IF MATCH "!" THEN
       (GETCH; SEARCH "!"; RESTART);
     IF MATCH "(*" THEN
       (SEARCH "*)"; RESTART);
     EXIT)

PROCEDURE string =
  (A := PARAMETER;
  B := CH;
  GETCH;
  CASE A OF
    0 : SKIP
    1 : APP B
    2 : APP 1
    OTHERWISE SKIP;
  UNTIL CH = B DO outchar;
  GETCH;
  IF A = 1 THEN APP B
  ELSE IF A = 2 THEN APP 1;
  scan)

PROCEDURE outchar =
  (IF CH = NEWLINEMARKER
     THEN (APP CR; APP LF)
     ELSE APP CH;
   GETCH)

PROCEDURE emit =
OPCODES
  "number"      -&gt;  %&lt;0A"D0A@:^U999C|0;'&gt;MP%
  "rep1"        -&gt;  ";MP"
  "check1"      -&gt;  '"SMP~|MO'
  "opt1"        -&gt;  '"SMP'
  "seq3"        -&gt;  ";MP&gt;"
  "cas1"        -&gt;
    "~@O%0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20%
     @O%others%&lt;"
  "look0"       -&gt;  +:Q8"E@^A%~symbol table is empty~%^C' M8+
  OTHERWISE
    LASTWISH "not defined in emit (internal error)~"

PROCEDURE glc =
CASE PARAMETER OF
  0 :
    (GEN "! HITECO VERSION 4 !~! COMPILATION = ! ";
    (* compute next version number in register 9 *)
    PUT ".U1 %9\ Q1,.:X9 Q1,.K @:^U9\ U9~~\")
  1 :
    (PUT ".UZ";
     GEN "@::S")
  2 :
    (GNR check1;
     GEN "@^A%";
     PUT "QZ,.:X9";
     GEN "expected in %")
  OTHERWISE
    LASTWISH "unknown case in glc (internal error)~"

PROCEDURE declaration =
  (* lookup for procedure names, into Q-register 8 *)
  (PUT "@^U8+&lt;+";
   PUT "^^E-1U8"; (* first procedure into Q-register E *)
   LOOP
     (IF CH = PERIOD
       THEN PUT "CMP0;";
     PUT "@:^U8+@::S\+";
     PUT %&lt; 0A"C 0A@:^U888 C F&lt; | MP 0; &gt;%;
     PUT '@:^U8+\"S^^+';
     PUT "%8@:^U8''";
     PUT "@:^U8+U7 0;'~+");
   PUT "@:^U8+ MO 0U7 0;&gt; MP Q7+")

 .
</pre>


</div>

</div>
