text/21-self-compiling-compilers.org
** The TECO target code

The TECO target code is given here for completeness,
most readers will want to skip the following three pages.

#+begin_example
! HITECO VERSION 4 !
! COMPILATION = ! 368 U9

@^UE`0MVMP@::S"DECLARE""SMPMI'<0A-^^."=0;'1T@::S"PROCEDURE""SMP
|MO@^A%"PROCEDURE" expected in %^Aprogram^A^C'@:^U9&@^U&MN96@:^U999@::S"=""SMP
|MO@^A%"=" expected in %^Aprogram^A^C'MF96@:^U999@:^U9&

&>`

@^UF`<
@::S"SKIP""SMP0;'
@::S"GNR""SMPMT0;'
@::S"NUMBER""SMP@:^U9%<0A"D0A@:^U999C|0;'>MP%0;'
@::S"VALUE""SMP3MV0;'
@::S"GETCH""SMP@:^U9&C&0;'
@::S"RESTART""SMP@:^U9&F<&0;'
@::S"EXIT""SMP@:^U9&0;&0;'
@::S"CODE""SMP@:^U9&0MQ&0;'
@::S"QUOTE""SMP@:^U9&1MQ&0;'
@::S"MESSAGE""SMP@:^U9&2MQ&0;'
@::S"PUT""SMP0MQ0;'
@::S"GEN""SMP@:^U9\@:^U9&\0MQ@:^U9\&\0;'
@::S"PRD""SMP@:^U9\@:^U9&\MF@:^U9\&\0;'
@::S"RETURN""SMPMH0;'
@::S"APP""SMPMH@:^U9&@:^U999&0;'
@::S"SEARCH""SMP@:^U9&@S&1MQ0;'
@::S"TYPE""SMPMS@:^U9&T&0;'
@::S"LINE""SMPMS@:^U9&L&0;'
@::S"JUMP""SMPMS@:^U9&J&0;'
@::S"WRITE""SMP2MQ0;'
@::S"LASTWISH""SMP@:^U9&MO&2MQ@:^U9&^C&0;'
@::S"LOOP""SMP@:^U9&<&MF@:^U9&>&0;'
@::S"(""SMP<MF
  @::S";";MP>@::S")""SMP
|MO@^A%")" expected in %^Acompound statement^A^C'0;'
@::S"REP""SMP@:^U9&<@::S&1MQ@:^U9";MP"MF@:^U9&>&0;'
@::S"CHECK""SMP@:^U9&@::S&1MQ@:^U9'"SMP
|MO'2MQ@:^U9&'&0;'
@::S"OPT""SMP@:^U9&@::S&1MQ@:^U9'"SMP'MF@:^U9&'&0;'
@::S"SEQ""SMP@:^U9&<&MF@::S"SEP""SMP
|MO@^A%"SEP" expected in %^Asequence statement^A^C'@:^U9&
  @::S&1MQ@:^U9";MP>"0;'
@::S"CHOICE""SMP@:^U9&<&MJ@::S"OTHERWISE""SMP
|MO@^A%"OTHERWISE" expected in %^ACHOICE statement^A^C'MF@:^U9&0;>&0;'
@::S"OPCODES""SMP@:^U9&<&MK@::S"OTHERWISE""SMP
|MO@^A%"OTHERWISE" expected in %^AOPCODES statement^A^C'MF@:^U9&0;>&0;'
@::S"WHILE""SMP@:^U9&<&MG@:^U9&|0;'&@::S"DO""SMP
|MO@^A%"DO" expected in %^AWHILE statement^A^C'MF@:^U9&>&0;'
@::S"UNTIL""SMP@:^U9&<&MG@:^U9&0;'&@::S"DO""SMP
|MO@^A%"DO" expected in %^AUNTIL statement^A^C'MF@:^U9&>&0;'
@::S"TO""SMPMH@::S"DO""SMP
|MO@^A%"DO" expected in %^ATO statement^A^C'@:^U9&<&MF@:^U9&>&0;'
@::S"IF""SMP@:^U9&
&MG@::S"THEN""SMP
|MO@^A%"THEN" expected in %^Aconditional^A^C'MF@::S"ELSE""SMP@:^U9&|&MF'@:^U9&'&0;'
@::S"CASE""SMPMH@:^U9"
@O%0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20%
     @O%others%<"@::S"OF""SMP
|MO@^A%"OF" expected in %^ACASE statement^A^C'ML@:^U9&!others!&@::S"OTHERWISE""SMP
|MO@^A%"OTHERWISE" expected in %^ACASE statement^A^C'MF@:^U9&0;>&0;'
0A-^^""=1MV1MQ2MV2MQ@:^U9&^C'&|
0A"V:Q8"E@^A%
symbol table is empty
%^C' M8UVMS@:^U9&M&QV@:^U999|
0A"W0AUVCMP@::S":=""SMP
|MO@^A%":=" expected in %^Aassignment statement^A^C'MH@:^U9&U&QV@:^U999|MO^Aillegal in statement
^A^C'''0;>`

@^UG`
@::S"MATCH""SMP@:^U9&@::S&1MQ@:^U9'"SMP'|MHMU'`

@^UH`<
@::S"PARAMETER""SMP0;'
@::S"CH""SMP@:^U9&0A&0;'
@::S"POINTER""SMP@:^U9&.&0;'
@::S"TAB""SMP@:^U9&9&0;'
@::S"LF""SMP@:^U9&10&0;'
@::S"CR""SMP@:^U9&13&0;'
@::S"SP""SMP@:^U9&32&0;'
@::S"PROCEDUREQUOTE""SMP@:^U9&96&0;'
@::S"NEWLINEMARKER""SMP@:^U9&126&0;'
@::S"DOUBLEQUOTE""SMP@:^U9&^^"&0;'
@::S"PERIOD""SMP@:^U9&^^.&0;'
@::S"LOOKUP""SMP@:^U9+:Q8"E@^A%
symbol table is empty
%^C' M8+0;'
@::S"(""SMP@:^U9&(&MHMM@::S")""SMP
|MO@^A%")"  expected in %^Aexpression^A^C'@:^U9&)&0;'
0A"W@:^U9&Q&0A@:^U999CMP|
0A"D<0A"D0A@:^U999C|0;'>MP|MO^Aillegal in expression
^A^C''0;>`

@^UM`<
@::S"+""SMP@:^U9&+&MHF<'
@::S"-""SMP@:^U9&-&MHF<'
@::S"*""SMP@:^U9&*&MHF<'
@::S"/""SMP@:^U9&/&MHF<'0;>`

@^UU`<
@::S"ALPHABETIC""SMP@:^U9&"A&0;'
@::S"LOWERCASE""SMP@:^U9&"V&0;'
@::S"UPPERCASE""SMP@:^U9&"W&0;'
@::S"DIGIT""SMP@:^U9&"D&0;'
@::S"CONSTITUENT""SMP@:^U9&"C&0;'
@::S"=""SMP@:^U9&-&MH@:^U9&"=&0;'
@::S"<""SMP@:^U9&-&MH@:^U9&"<&0;'
@::S">""SMP@:^U9&-&MH@:^U9&">&0;'MO^Aillegal predicate
^A^C0;>`

@^US`@::S"(""SMPMH@::S",""SMP@:^U9&,&MH'@::S")""SMP
|MO@^A%")" expected in %^Aparameterlist^A^C''`

@^UJ`<0A-^^""=|0;'@:^U9&
@::S&1MQ@:^U9'"SMP'MF@:^U9&0;'&>`

@^UK`<0A-^^""=|0;'@:^U9&
@::S&1MQ@:^U9'"SMP'@::S"->""SMP
|MO@^A%"->" expected in %^Acorrespondence^A^C'@:^U9&@:^U9\@:^U9&1MQ@:^U9&\0;'&>`

@^UL`<0A"D|0;'@:^U9&!&<0A"D0A@:^U999C|0;'>MP@:^U9&!&@::S":""SMP
|MO@^A%":" expected in %^Acases^A^C'MF@:^U9&0;&>`

@^UN`
0A"V:Q8"E@^A%
symbol table is empty
%^C' M8UR|
0A"C0AURCMP|MO^Aprocedurename expected
^A^C''QR@:^U999`

@^UO`.UP0L^A*****   ^A1T^A        ^A(QP-.)<
0A-9"=^A	^A|^A ^A'C>^A^
^AQPJ`

@^UP`<
0A-32"=CF<'
0A-9"=CF<'
0A-13"=CCF<'
@::S"!""SMPC@S"!"F<'
@::S"(*""SMP@S"*)"F<'0;>`

@^UQ`UA0AUBCQA
@O%0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20%
     @O%others%<!0!0;!1!QB@:^U9990;!2!1@:^U9990;!others!0;><0A-QB"=0;'MR>C
QA-1"=QB@:^U999|
QA-2"=1@:^U999''MP`

@^UR`
0A-126"=13@:^U99910@:^U999|0A@:^U999'C`

@^UT`<
@::S"number""SMP@:^U9\@:^U9%<0A"D0A@:^U999C|0;'>MP%\0;'
@::S"rep1""SMP@:^U9\@:^U9";MP"\0;'
@::S"check1""SMP@:^U9\@:^U9'"SMP
|MO'\0;'
@::S"opt1""SMP@:^U9\@:^U9'"SMP'\0;'
@::S"seq3""SMP@:^U9\@:^U9";MP>"\0;'
@::S"cas1""SMP@:^U9\@:^U9"
@O%0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20%
     @O%others%<"\0;'
@::S"look0""SMP@:^U9\@:^U9+:Q8"E@^A%
symbol table is empty
%^C' M8+\0;'MO^Anot defined in emit (internal error)
^A^C0;>`

@^UV`
@O%0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20%
     @O%others%<!0!@:^U9&! HITECO VERSION 4 !
! COMPILATION = ! &.U1 %9\ Q1,.:X9 Q1,.K @:^U9\ U9

\0;!1!.UZ@:^U9&@::S&0;!2!@:^U9'"SMP
|MO'@:^U9&@^A%&QZ,.:X9@:^U9&expected in %&0;!others!MO^Aunknown case in glc (internal error)
^A^C0;>`

@^UI`@^U8+<+^^E-1U8<
0A-^^."=CMP0;'@:^U8+@::S\+< 0A"C 0A@:^U888 C F< | MP 0; >@:^U8+\"S^^+%8@:^U8''@:^U8+U7 0;'
+>@:^U8+ MO 0U7 0;> MP Q7+`
#+end_example

