21-self-compiling-compilers.html

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> The TECO target code</h3>
<div class="outline-text-3" id="text-5-3">


<p>
The TECO target code is given here for completeness,
most readers will want to skip the following three pages.
</p>



<pre class="example">! HITECO VERSION 4 !
! COMPILATION = ! 368 U9

@^UE`0MVMP@::S"DECLARE""SMPMI'&lt;0A-^^."=0;'1T@::S"PROCEDURE""SMP
|MO@^A%"PROCEDURE" expected in %^Aprogram^A^C'@:^U9&amp;@^U&amp;MN96@:^U999@::S"=""SMP
|MO@^A%"=" expected in %^Aprogram^A^C'MF96@:^U999@:^U9&amp;

&amp;&gt;`

@^UF`&lt;
@::S"SKIP""SMP0;'
@::S"GNR""SMPMT0;'
@::S"NUMBER""SMP@:^U9%&lt;0A"D0A@:^U999C|0;'&gt;MP%0;'
@::S"VALUE""SMP3MV0;'
@::S"GETCH""SMP@:^U9&amp;C&amp;0;'
@::S"RESTART""SMP@:^U9&amp;F&lt;&amp;0;'
@::S"EXIT""SMP@:^U9&amp;0;&amp;0;'
@::S"CODE""SMP@:^U9&amp;0MQ&amp;0;'
@::S"QUOTE""SMP@:^U9&amp;1MQ&amp;0;'
@::S"MESSAGE""SMP@:^U9&amp;2MQ&amp;0;'
@::S"PUT""SMP0MQ0;'
@::S"GEN""SMP@:^U9\@:^U9&amp;\0MQ@:^U9\&amp;\0;'
@::S"PRD""SMP@:^U9\@:^U9&amp;\MF@:^U9\&amp;\0;'
@::S"RETURN""SMPMH0;'
@::S"APP""SMPMH@:^U9&amp;@:^U999&amp;0;'
@::S"SEARCH""SMP@:^U9&amp;@S&amp;1MQ0;'
@::S"TYPE""SMPMS@:^U9&amp;T&amp;0;'
@::S"LINE""SMPMS@:^U9&amp;L&amp;0;'
@::S"JUMP""SMPMS@:^U9&amp;J&amp;0;'
@::S"WRITE""SMP2MQ0;'
@::S"LASTWISH""SMP@:^U9&amp;MO&amp;2MQ@:^U9&amp;^C&amp;0;'
@::S"LOOP""SMP@:^U9&amp;&lt;&amp;MF@:^U9&amp;&gt;&amp;0;'
@::S"(""SMP&lt;MF
  @::S";";MP&gt;@::S")""SMP
|MO@^A%")" expected in %^Acompound statement^A^C'0;'
@::S"REP""SMP@:^U9&amp;&lt;@::S&amp;1MQ@:^U9";MP"MF@:^U9&amp;&gt;&amp;0;'
@::S"CHECK""SMP@:^U9&amp;@::S&amp;1MQ@:^U9'"SMP
|MO'2MQ@:^U9&amp;'&amp;0;'
@::S"OPT""SMP@:^U9&amp;@::S&amp;1MQ@:^U9'"SMP'MF@:^U9&amp;'&amp;0;'
@::S"SEQ""SMP@:^U9&amp;&lt;&amp;MF@::S"SEP""SMP
|MO@^A%"SEP" expected in %^Asequence statement^A^C'@:^U9&amp;
  @::S&amp;1MQ@:^U9";MP&gt;"0;'
@::S"CHOICE""SMP@:^U9&amp;&lt;&amp;MJ@::S"OTHERWISE""SMP
|MO@^A%"OTHERWISE" expected in %^ACHOICE statement^A^C'MF@:^U9&amp;0;&gt;&amp;0;'
@::S"OPCODES""SMP@:^U9&amp;&lt;&amp;MK@::S"OTHERWISE""SMP
|MO@^A%"OTHERWISE" expected in %^AOPCODES statement^A^C'MF@:^U9&amp;0;&gt;&amp;0;'
@::S"WHILE""SMP@:^U9&amp;&lt;&amp;MG@:^U9&amp;|0;'&amp;@::S"DO""SMP
|MO@^A%"DO" expected in %^AWHILE statement^A^C'MF@:^U9&amp;&gt;&amp;0;'
@::S"UNTIL""SMP@:^U9&amp;&lt;&amp;MG@:^U9&amp;0;'&amp;@::S"DO""SMP
|MO@^A%"DO" expected in %^AUNTIL statement^A^C'MF@:^U9&amp;&gt;&amp;0;'
@::S"TO""SMPMH@::S"DO""SMP
|MO@^A%"DO" expected in %^ATO statement^A^C'@:^U9&amp;&lt;&amp;MF@:^U9&amp;&gt;&amp;0;'
@::S"IF""SMP@:^U9&amp;
&amp;MG@::S"THEN""SMP
|MO@^A%"THEN" expected in %^Aconditional^A^C'MF@::S"ELSE""SMP@:^U9&amp;|&amp;MF'@:^U9&amp;'&amp;0;'
@::S"CASE""SMPMH@:^U9"
@O%0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20%
     @O%others%&lt;"@::S"OF""SMP
|MO@^A%"OF" expected in %^ACASE statement^A^C'ML@:^U9&amp;!others!&amp;@::S"OTHERWISE""SMP
|MO@^A%"OTHERWISE" expected in %^ACASE statement^A^C'MF@:^U9&amp;0;&gt;&amp;0;'
0A-^^""=1MV1MQ2MV2MQ@:^U9&amp;^C'&amp;|
0A"V:Q8"E@^A%
symbol table is empty
%^C' M8UVMS@:^U9&amp;M&amp;QV@:^U999|
0A"W0AUVCMP@::S":=""SMP
|MO@^A%":=" expected in %^Aassignment statement^A^C'MH@:^U9&amp;U&amp;QV@:^U999|MO^Aillegal in statement
^A^C'''0;&gt;`

@^UG`
@::S"MATCH""SMP@:^U9&amp;@::S&amp;1MQ@:^U9'"SMP'|MHMU'`

@^UH`&lt;
@::S"PARAMETER""SMP0;'
@::S"CH""SMP@:^U9&amp;0A&amp;0;'
@::S"POINTER""SMP@:^U9&amp;.&amp;0;'
@::S"TAB""SMP@:^U9&amp;9&amp;0;'
@::S"LF""SMP@:^U9&amp;10&amp;0;'
@::S"CR""SMP@:^U9&amp;13&amp;0;'
@::S"SP""SMP@:^U9&amp;32&amp;0;'
@::S"PROCEDUREQUOTE""SMP@:^U9&amp;96&amp;0;'
@::S"NEWLINEMARKER""SMP@:^U9&amp;126&amp;0;'
@::S"DOUBLEQUOTE""SMP@:^U9&amp;^^"&amp;0;'
@::S"PERIOD""SMP@:^U9&amp;^^.&amp;0;'
@::S"LOOKUP""SMP@:^U9+:Q8"E@^A%
symbol table is empty
%^C' M8+0;'
@::S"(""SMP@:^U9&amp;(&amp;MHMM@::S")""SMP
|MO@^A%")"  expected in %^Aexpression^A^C'@:^U9&amp;)&amp;0;'
0A"W@:^U9&amp;Q&amp;0A@:^U999CMP|
0A"D&lt;0A"D0A@:^U999C|0;'&gt;MP|MO^Aillegal in expression
^A^C''0;&gt;`

@^UM`&lt;
@::S"+""SMP@:^U9&amp;+&amp;MHF&lt;'
@::S"-""SMP@:^U9&amp;-&amp;MHF&lt;'
@::S"*""SMP@:^U9&amp;*&amp;MHF&lt;'
@::S"/""SMP@:^U9&amp;/&amp;MHF&lt;'0;&gt;`

@^UU`&lt;
@::S"ALPHABETIC""SMP@:^U9&amp;"A&amp;0;'
@::S"LOWERCASE""SMP@:^U9&amp;"V&amp;0;'
@::S"UPPERCASE""SMP@:^U9&amp;"W&amp;0;'
@::S"DIGIT""SMP@:^U9&amp;"D&amp;0;'
@::S"CONSTITUENT""SMP@:^U9&amp;"C&amp;0;'
@::S"=""SMP@:^U9&amp;-&amp;MH@:^U9&amp;"=&amp;0;'
@::S"&lt;""SMP@:^U9&amp;-&amp;MH@:^U9&amp;"&lt;&amp;0;'
@::S"&gt;""SMP@:^U9&amp;-&amp;MH@:^U9&amp;"&gt;&amp;0;'MO^Aillegal predicate
^A^C0;&gt;`

@^US`@::S"(""SMPMH@::S",""SMP@:^U9&amp;,&amp;MH'@::S")""SMP
|MO@^A%")" expected in %^Aparameterlist^A^C''`

@^UJ`&lt;0A-^^""=|0;'@:^U9&amp;
@::S&amp;1MQ@:^U9'"SMP'MF@:^U9&amp;0;'&amp;&gt;`

@^UK`&lt;0A-^^""=|0;'@:^U9&amp;
@::S&amp;1MQ@:^U9'"SMP'@::S"-&gt;""SMP
|MO@^A%"-&gt;" expected in %^Acorrespondence^A^C'@:^U9&amp;@:^U9\@:^U9&amp;1MQ@:^U9&amp;\0;'&amp;&gt;`

@^UL`&lt;0A"D|0;'@:^U9&amp;!&amp;&lt;0A"D0A@:^U999C|0;'&gt;MP@:^U9&amp;!&amp;@::S":""SMP
|MO@^A%":" expected in %^Acases^A^C'MF@:^U9&amp;0;&amp;&gt;`

@^UN`
0A"V:Q8"E@^A%
symbol table is empty
%^C' M8UR|
0A"C0AURCMP|MO^Aprocedurename expected
^A^C''QR@:^U999`

@^UO`.UP0L^A*****   ^A1T^A        ^A(QP-.)&lt;
0A-9"=^A        ^A|^A ^A'C&gt;^A^
^AQPJ`

@^UP`&lt;
0A-32"=CF&lt;'
0A-9"=CF&lt;'
0A-13"=CCF&lt;'
@::S"!""SMPC@S"!"F&lt;'
@::S"(*""SMP@S"*)"F&lt;'0;&gt;`

@^UQ`UA0AUBCQA
@O%0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20%
     @O%others%&lt;!0!0;!1!QB@:^U9990;!2!1@:^U9990;!others!0;&gt;&lt;0A-QB"=0;'MR&gt;C
QA-1"=QB@:^U999|
QA-2"=1@:^U999''MP`

@^UR`
0A-126"=13@:^U99910@:^U999|0A@:^U999'C`

@^UT`&lt;
@::S"number""SMP@:^U9\@:^U9%&lt;0A"D0A@:^U999C|0;'&gt;MP%\0;'
@::S"rep1""SMP@:^U9\@:^U9";MP"\0;'
@::S"check1""SMP@:^U9\@:^U9'"SMP
|MO'\0;'
@::S"opt1""SMP@:^U9\@:^U9'"SMP'\0;'
@::S"seq3""SMP@:^U9\@:^U9";MP&gt;"\0;'
@::S"cas1""SMP@:^U9\@:^U9"
@O%0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20%
     @O%others%&lt;"\0;'
@::S"look0""SMP@:^U9\@:^U9+:Q8"E@^A%
symbol table is empty
%^C' M8+\0;'MO^Anot defined in emit (internal error)
^A^C0;&gt;`

@^UV`
@O%0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20%
     @O%others%&lt;!0!@:^U9&amp;! HITECO VERSION 4 !
! COMPILATION = ! &amp;.U1 %9\ Q1,.:X9 Q1,.K @:^U9\ U9

\0;!1!.UZ@:^U9&amp;@::S&amp;0;!2!@:^U9'"SMP
|MO'@:^U9&amp;@^A%&amp;QZ,.:X9@:^U9&amp;expected in %&amp;0;!others!MO^Aunknown case in glc (internal error)
^A^C0;&gt;`

@^UI`@^U8+&lt;+^^E-1U8&lt;
0A-^^."=CMP0;'@:^U8+@::S\+&lt; 0A"C 0A@:^U888 C F&lt; | MP 0; &gt;@:^U8+\"S^^+%8@:^U8''@:^U8+U7 0;'
+&gt;@:^U8+ MO 0U7 0;&gt; MP Q7+`
</pre>


</div>

</div>
