text/21-self-compiling-compilers.org
** In conclusion

The HITECO project as described here
took about 6 man weeks to implement;
this figure is for writing source and target codes
and endless self-compilations and bootstrapping steps,
but excluding documentation.
The result has been an implementation
of a readable string processing language.
Further work should now concentrate on making available
to the HITECO user those features of TECO which the HITECO
compiler does not use itself.

TECO is a powerful language,
and it has numerous features that would not normally
be used in interactive text editing.
But there were some deficiencies:
The most annoying problem was the absurdly small
recursion stack of the old version of TECO ---
in the manual[!] it is said to be =about 10=.
Several intermediate versions of HITECO failed because
they required recursion just slightly deeper than TECO
will tolerate.

There are a number of things which ---
with the wisdom of hindsight ---
I would have liked to have done differently.
It would have been nice to have organised the versions in such a way
that each one can compile itself and its immediate successor.
During the development of the sequence
such versions did sometimes exist,
but there were too many of them to be kept.
With more careful design it would have been possible
to keep the number of generations quite low.
Perhaps somebody will be inspired to start again
by augmenting version 1.
It was probably a waste of time to generate pretty-printed
TECO code in the early versions.
Another mistake was to use the form =<CTRL/A>text<CTRL/A>=
for error messages, because the control characters
do not print (the form =@^A/text/= is used now).
As far as the implementation in TECO is concerned,
it might have been beneficial to produce code that
does not rely on the limited recursion stack of TECO,
but uses the very generous Q-register push-down list instead.
Such a change would best be done by modifying version 4,
but the price might be a dramatic loss of efficiency.

It is worth noting that the limitation on the size of the
recursion stack has been removed in the 1990 version
of VAX TECO.


* Exercises and reading

/Modifying the source language/:
You have an offer from a Polish software agent who
wants to buy a HITECO1 compiler,
but he wants the key words to be in Polish.
Assume that the English words =STATEMENT=,
=VARIABLE=, =QUOTE= etc.
have the Polish equivalent =STATEMENTSKY=,
=VARIABLESKY=, =QUOTESKY= etc.
Describe the steps needed to change the English version of HITECO1
to a Polish version.
All changes are to be made to the source,
editing the target is not allowed
(only Philistines do that).
The final product to be delivered is to consist of a source version
and a target version.

/Modifying the target language/:
Two of my students have used version 1 as a starting point
to write tiny self-compiling compilers which use C or Pascal
as the target language.
One of them volunteered the information that it was fun,
the other one did not say anything.

Use version 4 as a starting point
to write a self-compiling compiler which uses C or Pascal
or any other language as the target.
This could be done by bootstrapping,
by changing those parts in the HITECO4 source which generate TECO code.
Then the old TECO version would be used to compile this changed
source to a target version in the new language.
Then the target version can be used to compile the changed source again,
and if all went well then the resulting
second copy of the target should be identical to the first.
Alternatively,
if you do not have TECO to run a HITECO compiler
use the source as an aid in designing a new self-compiling compiler.

/Reading/:
A very comprehensive general account of self-compilation
and bootstrapping can be found in Lecarme and Pellissier Gart (1986).

