21-self-compiling-compilers.html

<div id="outline-container-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> In conclusion</h3>
<div class="outline-text-3" id="text-5-4">


<p>
The HITECO project as described here
took about 6 man weeks to implement;
this figure is for writing source and target codes
and endless self-compilations and bootstrapping steps,
but excluding documentation.
The result has been an implementation
of a readable string processing language.
Further work should now concentrate on making available
to the HITECO user those features of TECO which the HITECO
compiler does not use itself.
</p>
<p>
TECO is a powerful language,
and it has numerous features that would not normally
be used in interactive text editing.
But there were some deficiencies:
The most annoying problem was the absurdly small
recursion stack of the old version of TECO ---
in the manual[!] it is said to be <code>about 10</code>.
Several intermediate versions of HITECO failed because
they required recursion just slightly deeper than TECO
will tolerate.
</p>
<p>
There are a number of things which ---
with the wisdom of hindsight ---
I would have liked to have done differently.
It would have been nice to have organised the versions in such a way
that each one can compile itself and its immediate successor.
During the development of the sequence
such versions did sometimes exist,
but there were too many of them to be kept.
With more careful design it would have been possible
to keep the number of generations quite low.
Perhaps somebody will be inspired to start again
by augmenting version 1.
It was probably a waste of time to generate pretty-printed
TECO code in the early versions.
Another mistake was to use the form <code>&lt;CTRL/A&gt;text&lt;CTRL/A&gt;</code>
for error messages, because the control characters
do not print (the form <code>@^A/text/</code> is used now).
As far as the implementation in TECO is concerned,
it might have been beneficial to produce code that
does not rely on the limited recursion stack of TECO,
but uses the very generous Q-register push-down list instead.
Such a change would best be done by modifying version 4,
but the price might be a dramatic loss of efficiency.
</p>
<p>
It is worth noting that the limitation on the size of the
recursion stack has been removed in the 1990 version
of VAX TECO.

</p>
</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Exercises and reading</h2>
<div class="outline-text-2" id="text-6">


<p>
<i>Modifying the source language</i>:
You have an offer from a Polish software agent who
wants to buy a HITECO1 compiler,
but he wants the key words to be in Polish.
Assume that the English words <code>STATEMENT</code>,
<code>VARIABLE</code>, <code>QUOTE</code> etc.
have the Polish equivalent <code>STATEMENTSKY</code>,
<code>VARIABLESKY</code>, <code>QUOTESKY</code> etc.
Describe the steps needed to change the English version of HITECO1
to a Polish version.
All changes are to be made to the source,
editing the target is not allowed
(only Philistines do that).
The final product to be delivered is to consist of a source version
and a target version.
</p>
<p>
<i>Modifying the target language</i>:
Two of my students have used version 1 as a starting point
to write tiny self-compiling compilers which use C or Pascal
as the target language.
One of them volunteered the information that it was fun,
the other one did not say anything.
</p>
<p>
Use version 4 as a starting point
to write a self-compiling compiler which uses C or Pascal
or any other language as the target.
This could be done by bootstrapping,
by changing those parts in the HITECO4 source which generate TECO code.
Then the old TECO version would be used to compile this changed
source to a target version in the new language.
Then the target version can be used to compile the changed source again,
and if all went well then the resulting
second copy of the target should be identical to the first.
Alternatively,
if you do not have TECO to run a HITECO compiler
use the source as an aid in designing a new self-compiling compiler.
</p>
<p>
<i>Reading</i>:
A very comprehensive general account of self-compilation
and bootstrapping can be found in Lecarme and Pellissier Gart (1986).
</p>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-01-11 07:34:47 CST</p>
<p class="author">Author: michal</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
